package com.ccunix.ihousekeeping.base.domain;

import java.util.HashMap;
import java.util.Map;

public class ClientMessage {
	
	public static Map<String, String> map = new HashMap<String, String>();
	
	static{
		//用户登录提示
		map.put("M0_101", "请输入正确的手机号码");
		map.put("M0_102", "登录密码错误");
		map.put("M0_103","登录成功");
		map.put("M0_104","登录失败");//其他问题导致的失败，如：网络问题等等
		//添加爱车
		map.put("M4_101","请选择车型");
		map.put("M4_102","请选择车辆颜色");
		map.put("M4_103","车牌号不正确");
		map.put("M4_104","请输入正确的手机号码");
		map.put("M4_105","姓名不能为空");
		map.put("M4_106","添加成功");
		map.put("M4_106","添加失败");//其他问题导致的失败，如：网络问题等等
		map.put("M4_107","会员ID不能为空");
		//修改爱车
		map.put("M4_301","车牌号不正确");
		map.put("M4_302","请输入正确的手机号码");
		map.put("M4_303","姓名不能为空");
		map.put("M4_304","修改成功");
		map.put("M4_305","修改失败");//其他问题导致的失败，如：网络问题等等
		map.put("M4_306","车辆ID不能为空");
		map.put("M4_307","为查询到车辆");
		map.put("M4_308","此用户不存在");
		map.put("M4_309","未找到颜色码相关信息");
		map.put("M4_310","未找到车型相关信息");
		//删除爱车
		map.put("M4_201","删除成功");
		map.put("M4_202","删除失败");//其他问题导致的失败，如：网络问题等等
		map.put("M4_203","车辆ID不能为空");
		map.put("M4_202","该车辆不存在");
		//用户注册
		map.put("M0_001","请输入正确的手机号码");
		map.put("M0_002","验证码输入错误");
		map.put("M0_003","请输入6-20位的字母或数字组合");
		map.put("M0_004","两次密码不一致");
		map.put("M0_005","注册成功");
		map.put("M0_006","注册失败");//其他问题导致的失败，如：网络问题等等
		map.put("M0_007","用户已注册");
		//提交招募代理
		map.put("M1_001","姓名不能为空");
		map.put("M1_002","请输入正确的姓名");
		map.put("M1_003","手机号码不能为空");
		map.put("M1_004","手机号码不正确");
		map.put("M1_005","身份证号码不能为空");
		map.put("M1_006","请输入正确的身份证号码");
		map.put("M1_007","请选择你的工作城市");
		map.put("M1_008","请选择您的工作区域");
		map.put("M1_009","提交成功");
		map.put("M1_010","提交失败");//其他问题导致的失败，如：网络问题等等
		//设置用户头像
		map.put("M1_101","提交成功");
		map.put("M1_102","提交失败");
		//优惠券兑换码
		map.put("M0_501","兑换码不存在");
		map.put("M0_502","兑换码已失效");
		map.put("M0_503","兑换成功");
		map.put("M0_504","兑换失败");
		map.put("M0_505","会员id不存在");
		map.put("M0_506","会员ID不能为空");
		map.put("M0_507","兑换码不能为空");
		map.put("M0_508","领取途径不能为空");
		map.put("M0_509","领取途径不正确");
		map.put("M0_510","领取编号不能为空");
		map.put("M0_511","领取编号不正确");
		//提交评价
		map.put("M3_301","评价成功");
		map.put("M3_302","提交失败");
		//下单
		map.put("M3_401","下单成功");
		map.put("M3_402","下单失败");
		//修改密码
		map.put("M0_601","修改密码成功");
		map.put("M0_602","请输入6-20位数字或字母组合");
		map.put("M0_603","密码不能为空");
		map.put("M0_604","手机号码不能为空");
		map.put("M0_605","请输入正确的手机号码");
		map.put("M0_606","修改失败");
		//请求爱车
		map.put("M4_001","查询成功");
		map.put("M4_002","查询失败");
		map.put("M4_003","ID不能为空");
		map.put("M4_004","用户ID不存在");
		//获取待评价订单列表
		map.put("M3_201","获取成功");
		map.put("M3_202","获取失败");
		map.put("M3_203","ID不能为空");
		map.put("M3_204","用户ID不存在");
		map.put("M3_205","用户名下没有未评价订单");
		//查询订单
		map.put("M3_601","用户ID不能为空");
		map.put("M3_602","该用户暂无订单");
		map.put("M3_603","该用户不存在");
		map.put("M3_604","查询成功");
		//检测手机号是否在客户端注册
		map.put("M0_201","账号不能为空");
		map.put("M0_202","账号未注册");
		map.put("M0_203","账号已注册");
		//获取取消订单审核信息
		map.put("M8_1801","该订单尚未申请取消");
		map.put("M8_1802","订单号不能为空");
		map.put("M8_1803","查询成功");
		
		//取消订单
		map.put("M3_901", "订单信息不存在");
		map.put("M3_902", "订单已取消，无法重复取消");
		map.put("M3_903", "订单已完成，无法取消");
		map.put("M3_904", "订单取消成功");
		map.put("M3_905", "会员信息不存在");
		map.put("M3_906", "城市代理加盟商统计信息不存在");
		map.put("M3_907", "城市代理信息不存在");
		map.put("M3_908", "队长加盟商统计信息不存在");
		map.put("M3_909", "队长信息不存在");
		map.put("M3_910", "洗手加盟商统计信息不存在");
		map.put("M3_911", "洗手信息不存在");
		
		//洗手上线下线
		map.put("M8_001", "洗手信息不存在");
	    map.put("M8_002", "洗手上线成功");
	    map.put("M8_003", "洗手已上线，无法重复上线");
	    map.put("M8_004", "洗手下线成功");
	    map.put("M8_005", "洗手已下线，无法重复下线");
	    
	    //保存洗手位置信息
	    map.put("M8_501", "洗手信息不存在");
	    map.put("M8_502", "洗手位置信息保存成功");
	    
	    //客户首页
	    map.put("M2_001", "没有上线的洗手");
	    map.put("M2_002", "方圆3公里范围内没有洗手");
	    map.put("M2_003","获取洗手位置信息成功");
	    
	    //派单员发送支付请求给用户
	    map.put("M9_001", "订单信息不存在");
	    map.put("M9_002", "订单已支付");
	    map.put("M9_003", "发送支付请求成功");
	    
	    //派单员派发订单给洗手
	    map.put("M9_101", "洗手信息不存在，无发接单");
	    map.put("M9_102", "洗手下线状态，无发接单");
	    map.put("M9_103", "派单成功");
	    map.put("M9_104", "洗手正在接单中，无法重复接单");
	    
	    //发生验证码
	    map.put("M5_501", "短信发送成功");
	    map.put("M5_502", "短信发送失败");
	    map.put("M5_503", "验证码为空，请重新输入");
	    map.put("M5_504", "验证码无效，请重新发送验证码");
	    map.put("M5_505", "验证错误，请重新输入");
	    map.put("M5_506", "验证成功");
	    
	}
	
	public static String getClientMessage(int key){
		return map.get(key).toString();
	}
	
	public static void main(String[] args) {
		System.out.println(ClientMessage.getClientMessage(1001));
	}

}
